#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>

int main(void)
{
	// 회문대칭 판별법
	// 회문 => 앞뒤
	// level => 참
	// hello => 거짓

	/*
	사용자가 어떤 문자열을 입력했을 때, 회문대칭 판별법을 활용해서
	해당 문자열이 참인지, 거짓인지 판별 후 아래와 같은 문자를
	출력할 수 있는 프로그래밍 코드를 작성해주세요.

	1) 동일합니다.
	2) 동일하지 않습니다.

	1) 사용자로부터 문자열의 값을 받습니다.
	2) 사용자가 입력한 문자열의 길이
	> level > 반복해야하는 횟수의 범위
	3) 비교 : 0번째 -> 마지막번째 인덱스
	4) if 조건문을 활용해서 동일하다
	5) 동일하지 않습니다

	취업 // => 코테 (*자료구조, 알고리즘)
	// 많은 문제를 스스로의 힘으로 해결 훈련
	// 컴공
	// 코드 => 자료구조, 알고리즘
	*/

	return 0;
}